Revit 2024 API
PreferredJunctionType Enumeration
 Enumerated type representing the possible options for the preferred junction for a routine preference rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Since: 2013
Syntax
C#
public enum PreferredJunctionType
Visual Basic
Public Enumeration PreferredJunctionType
Visual C++
public enum class PreferredJunctionType
Members
Member name | Description
Tee |  Tee junction type.
Tap |  Tap junction type.
See Also
Autodesk.Revit.DB Namespace